# Pandas and Text Methods

We will use again the `people` dataframe, with some more people and columns:

In [1]:
import pandas as pd

In [2]:
names = ["Erika Schumacher", "Javi López", "Maria Rovira", "Ana Garamond", 
         "Shekhar Biswas", "Muriel Adams", "Saira Polom", "Alex Edwin", 
         "Kit Ching", "Dog Woof"]
ages = [22, 50, 23, 29, 44, 30, 25, 71, 35, 2]
nations = ["DE", "ES", "ES", "ES", "IN", "DE", "IN", "UK", "UK", "XX"]
sibilings = [2, 0, 4, 1, 1, 2, 3, 7, 0, 9]
colors = ["Red", "Yellow", "Yellow", "Blue", "Red", "Yellow", "Blue", "Blue", "Red", "Gray"]



people = pd.DataFrame({"name":names,
                       "age":ages,
                       "country":nations,
                       "sibilings":sibilings,
                       "favourite_color":colors
                      })

people.head()

               name  age country  sibilings favourite_color
0  Erika Schumacher   22      DE          2             Red
1        Javi López   50      ES          0          Yellow
2      Maria Rovira   23      ES          4          Yellow
3      Ana Garamond   29      ES          1            Blue
4    Shekhar Biswas   44      IN          1             Red

## Filtering data based on conditions

Let's say we want to select only rows for people whose favourite color is "Yellow".

If we just type the condition (`favourite_color=="Yellow"`), we will create a Pandas Series of boolean values of the same length as the rows in the dataframe. It holds `True` for rows where the condition is met, and `False` otherwise:

In [3]:
people.favourite_color=="Yellow"

0    False
1     True
2     True
3    False
4    False
5     True
6    False
7    False
8    False
9    False
Name: favourite_color, dtype: bool

Note: a Pandas Series is like a list, but it has an index and all of its elements must share the same data type. You can think of it as a "single column dataframe".

We can use this Series inside of the `loc[]` function we learned earlier to select only the rows that corrspond to the `True` values:

In [4]:
people.loc[people.favourite_color=="Yellow",]

           name  age country  sibilings favourite_color
1    Javi López   50      ES          0          Yellow
2  Maria Rovira   23      ES          4          Yellow
5  Muriel Adams   30      DE          2          Yellow

**Exercise:** Filter the `people` dataframe and keep only people from the UK.

In [5]:
people.loc[people.country == "UK"]

         name  age country  sibilings favourite_color
7  Alex Edwin   71      UK          7            Blue
8   Kit Ching   35      UK          0             Red

**Exercise:** Filter the `people` dataframe and keep only people from either the UK or Germany (the country code for Germany is "DE"). 

Tip: To use two conditions inside of `loc[]`, wrap each condition in parentheses and separate them using logical operators `&` if you need both conditions to be met or `|` if meeting one of the conditions is enough.

In [6]:
people.loc[(people.country ==  "DE") | (people.country == "UK")]

               name  age country  sibilings favourite_color
0  Erika Schumacher   22      DE          2             Red
5      Muriel Adams   30      DE          2          Yellow
7        Alex Edwin   71      UK          7            Blue
8         Kit Ching   35      UK          0             Red

**Exercise**: Filter the `people` dataframe and keep only:

- people from either the UK or Germany (the country code for Germany is "DE").
- people with 2 or more sibilings

In [7]:
people.loc[(people.country ==  "DE") | (people.country == "UK") & (people.sibilings > 1)]

               name  age country  sibilings favourite_color
0  Erika Schumacher   22      DE          2             Red
5      Muriel Adams   30      DE          2          Yellow
7        Alex Edwin   71      UK          7            Blue

## String Operations

The previous exercises could be solved combining simple conditions based on equalities (`==` or comparisons (`>`, `<`...). But when it comes to text data, sometimes the conditions are more complex. How would we select all the people whose name starts with a certain letter? 

This is where Pandas String Operations are really helpful. Go through [this user guide](https://pandas.pydata.org/docs/user_guide/text.html#string-methods) from Pandas' documentation, it is a good introduction to them. Here are some examples:

Filtering rows with name starting with A:

In [8]:
# we generate the boolean expression
people.name.str.startswith("A")

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7     True
8    False
9    False
Name: name, dtype: bool

In [9]:
# and we pass it to `loc[]`
people.loc[people.name.str.startswith("A"),]

           name  age country  sibilings favourite_color
3  Ana Garamond   29      ES          1            Blue
7    Alex Edwin   71      UK          7            Blue

String methods can also change text:

In [10]:
# Names to lower case
people.name.str.lower()

0    erika schumacher
1          javi lópez
2        maria rovira
3        ana garamond
4      shekhar biswas
5        muriel adams
6         saira polom
7          alex edwin
8           kit ching
9            dog woof
Name: name, dtype: object

Note that we have just outputted these names, but we have not changed the original dataframe:

In [11]:
people.head(2)

               name  age country  sibilings favourite_color
0  Erika Schumacher   22      DE          2             Red
1        Javi López   50      ES          0          Yellow

If we wanted to change the original dataframe, we would have assign this output (the names in lower case) to the column in the dataframe we want to change. When doing that, it is important that you select that column using `loc[]`, and not simply `DataFrame.column`:

In [12]:
people.loc[:,"name"] = people.name.str.lower()

In [13]:
# the original dataframe has been modified:
people.head(2)

               name  age country  sibilings favourite_color
0  erika schumacher   22      DE          2             Red
1        javi lópez   50      ES          0          Yellow

**Exercises:**

Select all people whose name contains (either in the first name or the surname) the letter `p`.

In [14]:
people.loc[people.name.str.contains("p")]

          name  age country  sibilings favourite_color
1   javi lópez   50      ES          0          Yellow
6  saira polom   25      IN          3            Blue

Select all people whose full name + surname has more than 12 characters.

In [15]:
people.loc[people.name.str.contains(r".{12}")]

               name  age country  sibilings favourite_color
0  erika schumacher   22      DE          2             Red
2      maria rovira   23      ES          4          Yellow
3      ana garamond   29      ES          1            Blue
4    shekhar biswas   44      IN          1             Red
5      muriel adams   30      DE          2          Yellow

Select all people whose surname starts with the letter `e`:

In [16]:
people.loc[people.name.str.startswith("e")]

               name  age country  sibilings favourite_color
0  erika schumacher   22      DE          2             Red

Create a new dataframe, `people_names`, where the first name and the last name are split into two different columns, `first_name` and `last_name`. The first row of the new dataframe should look like this:

`name           	first_name	last_name	age	country 	sibilings	favourite_color`

`erika schumacher	erika    	schumacher	22	DE      	2       	Red`

In [17]:
split_names = people.name.str.split(" ")

people["first_name"] = split_names.str.get(0).str.title()
people["last_name"] = split_names.str.get(1).str.title()



people_names = people[["first_name", "last_name", "age", "country", "sibilings", "favourite_color"]]

people_names.head()

  first_name   last_name  age country  sibilings favourite_color
0      Erika  Schumacher   22      DE          2             Red
1       Javi       López   50      ES          0          Yellow
2      Maria      Rovira   23      ES          4          Yellow
3        Ana    Garamond   29      ES          1            Blue
4    Shekhar      Biswas   44      IN          1             Red

## Cars challenges

Read the `vehicles.csv` dataset into a Pandas Dataframe called `cars`. We will use it for some extra challenges.

In [18]:
cars = pd.read_csv("pandas-platform-files/data/vehicles.csv")

Create a column called `Auto` filled with either `True` or `False` depending on whether the transmission is Automatic or not.

In [19]:
cars["Auto"] = cars.Transmission.str.contains("Auto")
cars.Auto.describe()

count     35952
unique        2
top        True
freq      24290
Name: Auto, dtype: object

Create a column called `Speeds` that contains the number of speeds each transmission has, based on the number that appears in the column `Transmission`. For example, a transmission named "Automatic 4-spd" has 4 speeds, and one named "Auto (AM6)" has 6 speeds. If you find edge cases (e.g. numbers that do not make sense, no number at all...), use your own judgement to assign values to them.

Note: you will most likely need to use something called a "Regular Expression" or "regex" inside of the string method. Regular expressions are sequences of characters designed to match patterns. They can become really complex (to match complex patterns), but for this case, a simple [5 minute tutorial](https://www.youtube.com/watch?v=UQQsYXa1EHs&ab_channel=Kite) or some google should be enough. Whenever you see people writing regex in plain python, remember that you can use any regular expression directly inside of a Pandas `str` method. In the example below, we use the regular expression `"[v-z]"`, which means "match any lowercase letter between v and z (alphabetically)", in combination with the string method `str.contains()`:

In [20]:
cars["Speeds"] = cars.Transmission.str.extract("(\d+)")
cars.Speeds = pd.to_numeric(cars.Speeds)

count = cars["Speeds"].isna().sum()

print("Null Values in Speeds: ",count,"\n")

cars.Speeds.info()

Null Values in Speeds:  681

<class 'pandas.core.series.Series'>
RangeIndex: 35952 entries, 0 to 35951
Series name: Speeds
Non-Null Count  Dtype
--------------  -----
35271 non-null  float64
dtypes: float64(1)
memory usage: 281.0 KB

Using string operations and your best judgement, clean the rest of the dataframe:

- Narrow down the "Fuel Type" column to 4-6 categories (include a category named "Others" if needed).
- Narrow down the "Vehicle Class" column to 4-8 categories.
- Remove non-alphanumeric characters from the "Drivetrain" and the "Make" column.

In [23]:
cars.columns = cars.columns.str.replace("[\s/]","_").str.lower()

/var/folders/kx/b3xc9jhj6qd_wgghcg01wqyr0000gn/T/ipykernel_34081/3277953852.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  cars.columns = cars.columns.str.replace("[\s/]","_").str.lower()

In [24]:
cars.fuel_type = cars.fuel_type.str.replace(".*Premium.*","Premium",regex= True)
cars.fuel_type = cars.fuel_type.str.replace(".*Regular.*","Regular",regex= True)
cars.fuel_type = cars.fuel_type.str.replace("(.*[Gg]as.*|CNG)","Gas",regex= True)

cars.groupby("fuel_type").count()

,make,model,year,engine_displacement,cylinders,transmission,drivetrain,vehicle_class,fuel_barrels_year,city_mpg,highway_mpg,combined_mpg,co2_emission_grams_mile,fuel_cost_year,auto,speeds
fuel_type,,,,,,,,,,,,,,,,
Diesel,911,911,911,911,911,911,911,911,911,911,911,911,911,911,911,911
Gas,1283,1283,1283,1283,1283,1283,1283,1283,1283,1283,1283,1283,1283,1283,1283,1278
Midgrade,74,74,74,74,74,74,74,74,74,74,74,74,74,74,74,74
Premium,10079,10079,10079,10079,10079,10079,10079,10079,10079,10079,10079,10079,10079,10079,10079,9994
Regular,23605,23605,23605,23605,23605,23605,23605,23605,23605,23605,23605,23605,23605,23605,23605,23014

In [33]:
cars.vehicle_class = cars.vehicle_class.str.replace(".*[Mm]id.*","Midclass",regex= True)
cars.vehicle_class = cars.vehicle_class.str.replace(".*[Ss]pecial.*","Special",regex= True)
cars.vehicle_class = cars.vehicle_class.str.replace(".*([Mm]ini|[Ss]mall|Two Seaters|[Cc]ompact).*","Small",regex= True)
cars.vehicle_class = cars.vehicle_class.str.replace(".*([Ll]arge|[Tt]ruck|[Vv]an).*","Large",regex= True)
cars.vehicle_class = cars.vehicle_class.str.replace(".*[Ss]port.*","Sport",regex= True)



cars.groupby("vehicle_class").count()

,make,model,year,engine_displacement,cylinders,transmission,drivetrain,fuel_type,fuel_barrels_year,city_mpg,highway_mpg,combined_mpg,co2_emission_grams_mile,fuel_cost_year,auto,speeds
vehicle_class,,,,,,,,,,,,,,,,
Large,8013,8013,8013,8013,8013,8013,8013,8013,8013,8013,8013,8013,8013,8013,8013,7978
Midclass,5112,5112,5112,5112,5112,5112,5112,5112,5112,5112,5112,5112,5112,5112,5112,4957
Small,16297,16297,16297,16297,16297,16297,16297,16297,16297,16297,16297,16297,16297,16297,16297,16001
Special,2246,2246,2246,2246,2246,2246,2246,2246,2246,2246,2246,2246,2246,2246,2246,2239
Sport,4284,4284,4284,4284,4284,4284,4284,4284,4284,4284,4284,4284,4284,4284,4284,4096